Rokasbarasa1/STM32-Quadcopter/src/main.c
/* Auto generated shit -----------------------------------------------*/
#include "main.h"
// #include "./FATFS/App/fatfs.h"

I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi3;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_rx;

void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_SPI3_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
/* Actual functional code -----------------------------------------------*/

#include "../lib/printf/retarget.h"
#include "stdio.h"
#include "string.h"

// Drivers
#include "../lib/mpu6050/mpu6050.h"
#include "../lib/qmc5883l/qmc5883l.h"
#include "../lib/bmp280/bmp280.h"
#include "../lib/bme280/bme280.h"
#include "../lib/bmp680/bmp680.h"
#include "../lib/mpl3115a2/mpl3115a2.h"
#include "../lib/ms5611/ms5611.h"
#include "../lib/bn357/bn357.h"
#include "../lib/nrf24l01/nrf24l01.h"
// #include "../lib/sd_card/sd_card.h"
#include "../lib/sd_card/sd_card_spi.h"


// Other imports
#include "../lib/utils/ned_coordinates/ned_coordinates.h"
#include "../lib/pid/pid.h"

void init_STM32_peripherals();
void calibrate_escs();
void fix_mag_axis(float *magnetometer_data);
void fix_gyro_axis(float *accelerometer_data_temp);
uint16_t setServoActivationPercent(float percent, uint16_t minValue, uint16_t maxValue);
double mapValue(double value, double input_min, double input_max, double output_min, double output_max);
void extract_request_values(char *request, uint8_t request_size, uint8_t *throttle, uint8_t *yaw, uint8_t *pitch, uint8_t *roll);
double get_sensor_fusion_altitude(double gps_altitude, double barometer_altitude);
u_int8_t init_sensors();
void init_loop_timer();
void check_calibrations();
void calibrate_gyro();
void get_initial_position();
void handle_loop_timing();

void extract_joystick_request_values_uint(char *request, uint8_t request_size, uint8_t *throttle, uint8_t *yaw, uint8_t *roll, uint8_t *pitch);
void extract_joystick_request_values_float(char *request, uint8_t request_size, float *throttle, float *yaw, float *roll, float *pitch);
void extract_request_type(char *request, uint8_t request_size, char *type_output);
void extract_pid_request_values(char *request, uint8_t request_size, double *added_proportional, double *added_integral, double *added_derivative, double *added_master);
void track_time();
double map_value(double value, double input_min, double input_max, double output_min, double output_max);
double apply_dead_zone(double value, double max_value, double min_value, double dead_zone);
void send_pid_base_info_to_remote();
void send_pid_added_info_to_remote();
char* generate_message_pid_values_nrf24(double base_proportional, double base_integral, double base_derivative, double base_master);

// PWM pins
// PA8  - 1 TIM1
// PA11 - 4 TIM1
// PA0  - 1 TIM2
// PA1  - 2 TIM2

// UART pins
// PA2  UART2 tx GPS
// PA3  UART2 rx GPS
// PA10 UART1 rx FTDI
// PA9  UART1 tx FTDI

// I2C pins
// PB7  I2C1 SDA
// PB6  I2C1 SCL

// SPI pins
// PA5  SPI1 SCK
// PA6  SPI1 MISO
// PA7  SPI1 MOSI

// GPIO
// PC13 Internal LED
// PB5  SPI RADIO
// PB4  SPI RADIO
// PA12 LED


/**
 * Timer peripheral clock: 50000000Hz
 * Pre scaler value: 250
 * Counter period: 4000
 * Timer clock divided by pre scaler: 200000.0Hz
 * Frequency: 50.0Hz
 * Max duty cycle: 20.0ms
 * Pwm value range: 0-4000
 * Resolution per pwm step: 0.005ms
 *

 * 
 * The esc is shit so we have different max and min than normal
 * 1.08ms/20ms * 4000(Counter period) = 216
 * 1.94ms/20ms * 4000 = 388
 */
const uint16_t max_esc_pwm_value = 388;
const uint16_t actual_max_esc_pwm_value = 370; // (max lipo amp rating / max draw of a bldc motor being used x 4) 0.917 * (max_pwm - min_pwm) + min_pwm = 371.4
const uint16_t min_esc_pwm_value = 188;

#define GPS_OUTPUT_BUFFER_SIZE 550
#define GPS_RECEIVE_BUFFER_SIZE 550

uint8_t gps_output_buffer[GPS_OUTPUT_BUFFER_SIZE];
uint8_t receive_buffer[GPS_RECEIVE_BUFFER_SIZE];

// Interrupt for uart 2 data received
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size)
{
    // make sure the dma is initialized before uart for this to work
    // and that dma is initialized after GPIO.

    // If the stm32 is restarted  while it is initializing dma the
    // data arrives from the uart and it fucks up. So you have to restart it a few times

    // HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, 1);

    if (huart->Instance == USART2)
    {
        // printf("Interrupt UART 2\n");
        memcpy((uint8_t *)gps_output_buffer, receive_buffer, Size);
        // unsigned char gpsString[] = "dfdgfhdfdfhsdfh$GNGGA,,,N,,E,,,,,M,,M,,*7413.786016\ndasdasd";
        // bn357_parse_and_store(gpsString, Size);
        bn357_parse_and_store((unsigned char*)gps_output_buffer, Size);
        /* start the DMA again */
        HAL_UARTEx_ReceiveToIdle_DMA(&huart2, (uint8_t *)receive_buffer, GPS_RECEIVE_BUFFER_SIZE);
        __HAL_DMA_DISABLE_IT(&hdma_usart2_rx, DMA_IT_HT);
    }
}

// Interrupt for uart 2 when it crashes to restart it
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2)
    {
        // printf("Error UART 2\n");
        HAL_UART_DeInit(&huart2);
        HAL_UART_Init(&huart2);

        HAL_UARTEx_ReceiveToIdle_DMA(&huart2, receive_buffer, GPS_RECEIVE_BUFFER_SIZE);
        __HAL_DMA_DISABLE_IT(&hdma_usart2_rx, DMA_IT_HT);
    }
}


// Sensor corrections #################################################################################

// For calibrating the magnetometer I
// used a method found in MicWro Engr Video:
// https://www.youtube.com/watch?v=MinV5V1ioWg
// Mag field norm at my location is 50.503
// use software called Magneto 1.2


// https://www.ngdc.noaa.gov/geomag/calculators/magcalc.shtml#igrfwmm
// Convert readings from this site to same units nanoTeslas to microteslas

// When calculating this remember that these values are already
// correcting and that the axis of the magnetometer are switched.

// float hard_iron_correction[3] = {
//     0, 0, 0
// };

