Rokasbarasa1/STM32-Quadcopter/src/main.c
// float soft_iron_correction[3][3] = {
//     {1,0,0},
//     {0,1,0},
//     {0,0,1}
// };


float hard_iron_correction[3] = {
    -26.418969, 308.296635, 189.949606
};

float soft_iron_correction[3][3] = {
    {3.650759,0.250193,-0.058046},
    {0.250193,4.132441,-0.245339},
    {-0.058046,-0.245339,3.733419}
};

float accelerometer_correction[3] = {
    0.024980, -0.020180, 1.144808
};
float gyro_correction[3] = {
    -2.651069, 3.157305, 0.638099
};


// handling loop timing ###################################################################################
uint32_t loop_start_time = 0;
uint32_t loop_end_time = 0;
int16_t delta_loop_time = 0;

// Accelerometer values to degrees conversion #############################################################
float accelerometer_x_rotation = 0;
float accelerometer_y_rotation = 0;
float magnetometer_z_rotation = 0;

// Radio config ########################################################################################### 
uint8_t tx_address[5] = {0xEE, 0xDD, 0xCC, 0xBB, 0xAA};
char rx_data[32];
char rx_type[32];

// PID errors ##############################################################################################
double error_pitch = 0;
double error_roll = 0;
double error_yaw = 0;
double error_altitude = 0;

// Actual PID adjustment for pitch
// const double base_pitch_master_gain = 1.0;
// const double base_pitch_gain_p = 0.0; // 0.35
// const double base_pitch_gain_i = 0.0; // 0.0
// const double base_pitch_gain_d = 0.0; // 130.0
#define BASE_PITCH_ROLL_MASTER_GAIN 0.4
#define BASE_PITCH_ROLL_GAIN_P 0.0
#define BASE_PITCH_ROLL_GAIN_I 0.0
#define BASE_PITCH_ROLL_GAIN_D 0.0

// Before idle motors
// const double gain_p = 0.41; 
// const double gain_i = 0.1;
// const double gain_d = 0.0;

// Notes for PID
// 1) It is important that the natural state without power of the drone is not stable, otherwise 
// some offset of center off mass or pid desired point needs to introduced
// 2) Remember that the drone when in the air has motors spinning at idle power, just enough 
// to float in the air. If you are testing with drone constrained add a base motor speed to account for this.


// With quadcopter got 1.4 on P and it balanced for a bit but still wobbly

// PID for yaw
const float yaw_gain_p = 0.0; 
const float yaw_gain_i = 0.0;
const float yaw_gain_d = 0.0;

// PID for yaw
const float altitude_gain_p = 0.0; 
const float altitude_gain_i = 0.0;
const float altitude_gain_d = 0.0;

// Used for smooth changes to PID while using remote control. Do not touch this

double pitch_roll_master_gain = BASE_PITCH_ROLL_MASTER_GAIN; // Dont you just love the STM#2 compiler?
double pitch_roll_gain_p = BASE_PITCH_ROLL_GAIN_P;
double pitch_roll_gain_i = BASE_PITCH_ROLL_GAIN_I;
double pitch_roll_gain_d = BASE_PITCH_ROLL_GAIN_D;

double added_pitch_roll_master_gain = 0;
double added_pitch_roll_gain_p = 0;
double added_pitch_roll_gain_i = 0;
double added_pitch_roll_gain_d = 0;

// Refresh rate ##############################################################################################

// remember that the stm32 is not as fast as the esp32 and it cannot print lines at the same speed
// const float refresh_rate_hz = 400;
#define REFRESH_RATE_HZ 200

// Sensor stuff ##############################################################################################
float complementary_ratio = 1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ)); // Depends on how often the loop runs. 1 second / (1 second + one loop time)
float acceleration_data[] = {0,0,0};
float gyro_angular[] = {0,0,0};
float gyro_degrees[] = {0,0,0};
float magnetometer_data[] = {0,0,0};
double gps_longitude = 0.0;
double gps_latitude = 0.0;
float pressure = 0.0;
float temperature = 0.0;
float altitude = 0.0;

double target_pitch = 0.0;
double target_roll = 0.0;
double target_yaw = 0.0;
double target_altitude = 0.0;

double motor_power[] = {0.0, 0.0, 0.0, 0.0};


// Remote control settings ############################################################################################
double max_yaw_attack = 20.0;
double max_pitch_attack = 10;
double pitch_attack_step = 0.1;

double max_roll_attack = 10;
double roll_attack_step = 0.1;

// uint8_t throttle = 0;
// uint8_t yaw = 50;
// uint8_t last_yaw = 50;
// uint8_t pitch = 50;
// uint8_t roll = 50;

float throttle = 0.0;
float yaw = 50.0;
float last_yaw = 50.0;
float pitch = 50.0;
float roll = 50.0;

uint8_t shit_encoder_mode = 0;
uint8_t slowing_lock = 0;

double last_raw_yaw = 0;
double delta_yaw = 0;

float minimum_signal_timing_seconds = 0.2; // Seconds
uint32_t last_signal_timestamp = 0;


// For deciding which log file to log to
char log_file_base_name[] = "Quadcopter.txt";
uint8_t sd_card_initialized = 0;
uint8_t log_loop_count = 0;
uint8_t sd_card_async = 0;


// Keep track of time in each loop. Since loop start
uint32_t startup_time = 0;
uint32_t delta_time = 0;
uint16_t time_since_startup_ms = 0;
uint8_t time_since_startup_minutes = 0;
uint8_t time_since_startup_seconds = 0;
uint8_t time_since_startup_hours = 0;

int main(void){
    init_STM32_peripherals();

    // Turn off the blue led. Will show the status of sd logging later
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);

    printf("STARTING PROGRAM\n"); 
    // calibrate_escs();
    if(init_sensors() == 0){
        return 0; // exit if initialization failed
    }
    // check_calibrations();
    // calibrate_gyro(); // Recalibrate the gyro as the temperature affects the calibration
    get_initial_position();

    struct pid pitch_pid = pid_init(pitch_roll_master_gain * pitch_roll_gain_p, pitch_roll_master_gain * pitch_roll_gain_i, pitch_roll_master_gain * pitch_roll_gain_d, 0.0, HAL_GetTick(), 20.0, -20.0, 1);
    struct pid roll_pid = pid_init(pitch_roll_master_gain * pitch_roll_gain_p, pitch_roll_master_gain * pitch_roll_gain_i, pitch_roll_master_gain * pitch_roll_gain_d, 0.0, HAL_GetTick(), 20.0, -20.0, 1);
    struct pid yaw_pid = pid_init(yaw_gain_p, yaw_gain_i, yaw_gain_d, 0.0, HAL_GetTick(), 0, 0, 0);
    struct pid altitude_pid = pid_init(altitude_gain_p, altitude_gain_i, altitude_gain_d, 0.0, HAL_GetTick(), 0, 0, 0);

    // Initialize sd card logging
    sd_card_initialize_spi(&hspi3, GPIOA, GPIO_PIN_15, GPIOA, GPIO_PIN_12);
    if(sd_test_interface()){
        sd_card_initialized = sd_special_initialize(log_file_base_name);
        if(sd_card_initialized){
            sd_card_async = sd_special_enter_async_mode();
        }
    }else{
        printf("Failed to initialize the sd card interface\n");
    }
    
    printf("Looping\n");
    init_loop_timer();
    startup_time = HAL_GetTick();
    while (1){
        // printf("Loop ");
        
