Rokasbarasa1/STM32-Quadcopter/src/main.c
        // Gathering data from sensors and transforming it: 2 ms at most
        // Read sensor data ######################################################################################################################
        // gps_latitude = bn357_get_latitude_decimal_format();
        // gps_longitude = bn357_get_longitude_decimal_format();
        // temperature = bmp280_get_temperature_celsius();

        // calculate the altitude using gps altitude and a bmp280 reference altitude
        // Reset the reference on bmp280 every time the gps gets updated
        // So the barometer keeps track in between the gps updates and does so with the 
        // origin of the precise altitude value from gps

        // altitude = get_sensor_fusion_altitude(bn357_get_altitude_meters() ,(double)bmp280_get_height_meters_from_reference(bn357_get_status_up_to_date(1)));


        mpu6050_get_accelerometer_readings_gravity(acceleration_data);
        mpu6050_get_gyro_readings_dps(gyro_angular);
        qmc5883l_magnetometer_readings_micro_teslas(magnetometer_data);

        // Convert the sensor data to data that is useful
        fix_mag_axis(magnetometer_data); // Switches around the x and the y of the magnetometer to match mpu6050 outputs
        calculate_degrees_x_y(acceleration_data, &accelerometer_x_rotation, &accelerometer_y_rotation); // Get roll and pitch from the data. I call it x and y. Ranges -90 to 90. 

        // My mpu6050 has a drift problem when rotating around z axis. I have only seen Joop Broking having this problem.
        // Raw yaw - yaw without tilt adjustment
        // Yaw - yaw with tilt adjustment
        // Get raw yaw. The results of this adjustment have to modify the values of gyro degrees before complementary filter. So only the non tilt adjusted yaw is available
        calculate_yaw(magnetometer_data, &magnetometer_z_rotation);

        // if(yaw != 50){ // This is not an issue when not rotating.
        //     // Joop Brokings method did not work for me and it didn't make sense subtracting scaled total yaw. I subtract delta yaw instead
        //     delta_yaw = angle_difference(magnetometer_z_rotation, last_raw_yaw); // Helper function to handle wrapping

        //     // gyro_angular[0] -= delta_yaw * -16.5; 
        //     gyro_angular[0] -= delta_yaw * -5.0; 

        //     // This robot doesn't use the y axis so i ignore it 
        // }

        // Save the raw yaw for next loop. No mater if yaw changes or not. Need to know the latest one
        last_raw_yaw = magnetometer_z_rotation;

        // Use complementary filter to correct the gyro drift. 
        convert_angular_rotation_to_degrees_x_y(gyro_angular, gyro_degrees, accelerometer_x_rotation, accelerometer_y_rotation, HAL_GetTick(), 1);

        // Get yaw that is adjusted by x and y degrees
        calculate_yaw_tilt_compensated(magnetometer_data, &magnetometer_z_rotation, gyro_degrees[0], gyro_degrees[1]);

        // Complementary filter did not work good for magnetometer+gyro. 
        // Gyro just too slow and inaccurate for this.
        // I trust the magnetometer more than the gyro in this case.
        gyro_degrees[2] = magnetometer_z_rotation;

        fix_gyro_axis(gyro_degrees); // switch the x and y axis of gyro

        // Receive remote control data ###########################################################################################################
        if(nrf24_data_available(1)){ // takes 3-4 ms
            nrf24_receive(rx_data); // takes 8-9 ms
            // Get the type of request
            extract_request_type(rx_data, strlen(rx_data), rx_type);

            if(strcmp(rx_type, "js") == 0){
                last_signal_timestamp = HAL_GetTick();

                // extract_joystick_request_values_uint(rx_data, strlen(rx_data), &throttle, &yaw, &roll, &pitch);
                extract_joystick_request_values_float(rx_data, strlen(rx_data), &throttle, &yaw, &roll, &pitch);


                // Throttle does not need to be handled

                // Pitch ##################################################################################################################
                // Check if pitch is neutral
                if(pitch == 50){
                    // Had some issues with floats not being zero.
                    // If value is between pitch attack and negative pitch attack then just set it to zero
                    if(target_pitch < pitch_attack_step/2 && target_pitch > -pitch_attack_step/2){
                        target_pitch = 0.0;
                    }
                    // If value is above pitch attack values 
                    // Start slowing going back to zero
                    if(target_pitch > 0 && target_pitch != 0){
                        target_pitch = target_pitch - pitch_attack_step;
                    }else if(target_pitch < 0  && target_pitch != 0){
                        target_pitch = target_pitch + pitch_attack_step;
                    }
                }else if (pitch != 50){
                    // If pitch is not neutral start increasing into some direction.
                    if(shit_encoder_mode){
                        // Because my encoder is shit it prefers to have the extremes of pitch as 
                        // that doesn't overwhelm the pid of it.
                        if(pitch > 60){
                            target_pitch = target_pitch + pitch_attack_step;
                        }else if(pitch < 40){
                            target_pitch = target_pitch - pitch_attack_step;
                        }
                    }else{
                        target_pitch = target_pitch + map_value(pitch, 0.0, 100.0, -pitch_attack_step, pitch_attack_step);
                    }
                }

                // Make sure that the value is in the boundaries
                if(target_pitch > max_pitch_attack){
                    target_pitch = max_pitch_attack;
                }else if(target_pitch < -max_pitch_attack){
                    target_pitch = -max_pitch_attack;
                }


