Rokasbarasa1/STM32-Quadcopter/src/main.c
                // Roll ##################################################################################################################
                // Check if roll is neutral
                if(roll == 50){
                    // Had some issues with floats not being zero.
                    // If value is between roll attack and negative roll attack then just set it to zero
                    if(target_roll < roll_attack_step/2 && target_roll > -roll_attack_step/2){
                        target_roll = 0.0;
                    }
                    // If value is above roll attack values 
                    // Start slowing going back to zero
                    if(target_roll > 0 && target_roll != 0){
                        target_roll = target_roll - roll_attack_step;
                    }else if(target_roll < 0  && target_roll != 0){
                        target_roll = target_roll + roll_attack_step;
                    }
                }else if (roll != 50){
                    // If roll is not neutral start increasing into some direction.
                    if(shit_encoder_mode){
                        // Because my encoder is shit it prefers to have the extremes of roll as 
                        // that doesn't overwhelm the pid of it.
                        if(roll > 60){
                            target_roll = target_roll + roll_attack_step;
                        }else if(pitch < 40){
                            target_roll = target_roll - roll_attack_step;
                        }
                    }else{
                        target_roll = target_roll + map_value(roll, 0.0, 100.0, -roll_attack_step, roll_attack_step);
                    }
                }

                // Make sure that the value is in the boundaries
                if(target_roll > max_roll_attack){
                    target_roll = max_roll_attack;
                }else if(target_roll < -max_roll_attack){
                    target_roll = -max_roll_attack;
                }

                // Yaw ##################################################################################################################
                if(yaw != 50){
                    // There is an issue with the remote sometimes sending a 0 yaw
                    target_yaw = gyro_degrees[2] + map_value(yaw, 0.0, 100.0, -max_yaw_attack, max_yaw_attack);
                    // handle the switch from -180 to 180 degrees
                    if(target_yaw > 180.0){
                        target_yaw = target_yaw - 360.0;
                    }else if(target_yaw < -180.0){
                        target_yaw = target_yaw + 360.0;
                    }
                }

                // Reset the yaw to the current degrees
                if(last_yaw != 50 && yaw == 50){
                    target_yaw = gyro_degrees[2];
                }

                last_yaw = yaw;

            }else if(strcmp(rx_type, "pid") == 0){
                printf("\nGot pid");

                double added_proportional = 0;
                double added_integral = 0;
                double added_derivative = 0;
                double added_master_gain = 0;

                extract_pid_request_values(rx_data, strlen(rx_data), &added_proportional, &added_integral, &added_derivative, &added_master_gain);

                pitch_roll_gain_p = BASE_PITCH_ROLL_GAIN_P + added_proportional;
                pitch_roll_gain_i = BASE_PITCH_ROLL_GAIN_I + added_integral;
                pitch_roll_gain_d = BASE_PITCH_ROLL_GAIN_D + added_derivative;
                pitch_roll_master_gain = BASE_PITCH_ROLL_MASTER_GAIN + added_master_gain;

                added_pitch_roll_gain_p = added_proportional;
                added_pitch_roll_gain_i = added_integral;
                added_pitch_roll_gain_d = added_derivative;
                added_pitch_roll_master_gain = added_master_gain;

                // Configure the pitch pid 
                pid_set_proportional_gain(&pitch_pid, pitch_roll_gain_p * pitch_roll_master_gain);
                pid_set_integral_gain(&pitch_pid, pitch_roll_gain_i * pitch_roll_master_gain);
                pid_set_derivative_gain(&pitch_pid, pitch_roll_gain_d * pitch_roll_master_gain);
                pid_reset_integral_sum(&pitch_pid);

                // Configure the roll pid 
                pid_set_proportional_gain(&roll_pid, pitch_roll_gain_p * pitch_roll_master_gain);
                pid_set_integral_gain(&roll_pid, pitch_roll_gain_i * pitch_roll_master_gain);
                pid_set_derivative_gain(&roll_pid, pitch_roll_gain_d * pitch_roll_master_gain);
                pid_reset_integral_sum(&roll_pid);

            }else if(strcmp(rx_type, "remoteSyncBase") == 0){
                printf("\nGot remoteSyncBase");
                send_pid_base_info_to_remote();
            }else if(strcmp(rx_type, "remoteSyncAdded") == 0){
                printf("\nGot remoteSyncAdded");
                send_pid_added_info_to_remote();
            }

            rx_type[0] = '\0'; // Clear out the string by setting its first char to string terminator
        }

        // double error_altitude = mapValue(pid_get_error(&altitude_pid, altitude, HAL_GetTick()), -180.0, 180.0, -100.0, 100.0);
        // printf("Altitude error %6.2f ", error_altitude);
        
        // For the robot to do work it needs to be receiving radio signals and at the correct angles, facing up
        if(
            gyro_degrees[0] <  30 && 
            gyro_degrees[0] > -30 && 
            gyro_degrees[1] <  30 && 
            gyro_degrees[1] > -30 && 
            ((double)HAL_GetTick() - (double)last_signal_timestamp) / 1000.0 <= minimum_signal_timing_seconds
        ){
            // pid_set_desired_value(&pitch_pid, target_pitch);
            // pid_set_desired_value(&roll_pid, target_roll);
            // pid_set_desired_value(&yaw_pid, target_yaw);
            // pid_set_desired_value(&altitude_pid, target_altitude);

            // pitch is facing to the sides
            // roll is facing forwards and backwards
            error_pitch = pid_get_error(&pitch_pid, gyro_degrees[0], HAL_GetTick());
            error_roll = pid_get_error(&roll_pid, gyro_degrees[1], HAL_GetTick());
            // error_yaw = pid_get_error(&roll_pid, gyro_degrees[2], HAL_GetTick());
            // error_altitude = pid_get_error(&roll_pid, altitude, HAL_GetTick());

            error_altitude = throttle*0.9;

