Rokasbarasa1/STM32-Quadcopter/src/main.c
            motor_power[0] = error_altitude + (-error_pitch) +  (-error_roll);
            motor_power[1] = error_altitude + (-error_pitch) +  ( error_roll);
            motor_power[2] = error_altitude + ( error_pitch) +  ( error_roll);
            motor_power[3] = error_altitude + ( error_pitch) +  (-error_roll);


            // Motor A (4) 13740 rpm or 229 rotations per second
            // Motor B (1) 14460 rpm or 241
            // Motor C (2) 14160 rpm or 236
            // Motor D (3) 14460 rpm or 241


            // GPS side
            TIM2->CCR1 = setServoActivationPercent(motor_power[2], min_esc_pwm_value, actual_max_esc_pwm_value);
            TIM2->CCR2 = setServoActivationPercent(motor_power[3], min_esc_pwm_value, actual_max_esc_pwm_value);

            // No gps side
            TIM1->CCR1 = setServoActivationPercent(motor_power[0], min_esc_pwm_value, actual_max_esc_pwm_value);
            TIM1->CCR4 = setServoActivationPercent(motor_power[1], min_esc_pwm_value, actual_max_esc_pwm_value);
            // printf("1 %f\n", throttle);
        }else{
            // GPS side
            TIM2->CCR1 = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value);
            TIM2->CCR2 = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value);

            // No gps side
            TIM1->CCR1 = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value);
            TIM1->CCR4 = setServoActivationPercent(0, min_esc_pwm_value, actual_max_esc_pwm_value);
            // printf("0\n");
        }

        delta_time = HAL_GetTick() - startup_time;
        time_since_startup_hours = delta_time / 3600000;
        time_since_startup_minutes = (delta_time - time_since_startup_hours * 3600000) / 60000;
        time_since_startup_seconds = (delta_time - time_since_startup_hours * 3600000 - time_since_startup_minutes * 60000) / 1000;
        time_since_startup_ms = delta_time - time_since_startup_hours * 3600000 - time_since_startup_minutes * 60000 - time_since_startup_seconds * 1000;

        // Print out for debugging
        // printf("%d:%02d:%02d:%03d;", time_since_startup_hours, time_since_startup_minutes, time_since_startup_seconds, time_since_startup_ms);
        // printf("ACCEL, %6.2f, %6.2f, %6.2f, ", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
        // printf("GYRO, %6.2f, %6.2f, %6.2f, ", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
        // printf("GY %6.2f %6.2f", gyro_degrees[0], gyro_degrees[1]);

        // printf("MAG, %6.2f, %6.2f, %6.2f, ", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
        // printf("MOTOR 1=%6.2f 2=%6.2f 3=%6.2f 4=%6.2f, ", motor_power[0], motor_power[1], motor_power[2], motor_power[3]);
        // printf("TEMP %6.5f, ", temperature);
        // printf("ALT %6.2f, ", altitude);
        // printf("GPS %f, %f, ", gps_longitude, gps_latitude);
        // printf("ERROR pitch %6.2f, roll %6.2f, pitch %6.2f, yaw %6.2f, altitude %6.2f, ", error_pitch, error_roll, error_yaw, error_altitude);
        // printf("%6.5f %6.5f %6.5f", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);  
        // printf("\n");

        if(sd_card_initialized){
            // Log a bit of data
            sd_card_append_to_buffer(1, "%02d:%02d:%02d:%03d;", time_since_startup_hours, time_since_startup_minutes, time_since_startup_seconds, time_since_startup_ms);
            // sd_card_append_to_buffer(1, "ACCEL,%.2f,%.2f,%.2f;", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
            sd_card_append_to_buffer(1, "GYRO,%.2f,%.2f,%.2f;", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
            // sd_card_append_to_buffer(1, "MAG,%.2f,%.2f,%.2f;", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
            sd_card_append_to_buffer(1, "MOTOR,1=%.2f,2=%.2f,3=%.2f,4=%.2f;", motor_power[0], motor_power[1], motor_power[2], motor_power[3]);
            sd_card_append_to_buffer(1, "ERROR,pitch=%.2f,roll=%.2f,yaw=%.2f,altitude=%.2f;", error_pitch, error_roll, error_yaw, error_altitude);
            // sd_card_append_to_buffer(1, "TEMP,%.2f;", temperature);
            // sd_card_append_to_buffer(1, "ALT %.2f;", altitude);
            // sd_card_append_to_buffer(1, "GPS,lon-%f,lat-%f;", gps_longitude, gps_latitude);
            sd_card_append_to_buffer(1, "\n");
            log_loop_count++;
        }

        if(sd_card_initialized && log_loop_count > 0){
            // Get the buffer pointer send it to the sd writer
            
            if(sd_card_async){
                sd_special_write_chunk_of_data_async(sd_card_get_buffer_pointer(1));
            }else{
                sd_card_initialized = sd_special_write_chunk_of_data(sd_card_get_buffer_pointer(1));
            }
            
            // Clear the local buffer of data
            sd_buffer_clear(1);
            log_loop_count = 0;
        }

        // Update the blue led with current sd state
        if(sd_card_initialized){
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
        }else{
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
        }

        fix_gyro_axis(gyro_degrees); // switch back the x and y axis of gyro to how they were before. This is for sensor fusion not to be confused 

        handle_loop_timing();
    }
}

void init_STM32_peripherals(){
    HAL_Init();
    SystemClock_Config();
    MX_GPIO_Init();
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, 0);

    HAL_Delay(1);
    MX_DMA_Init(); // This has to be before the uart inits, otherwise dma interrupts dont work
    MX_I2C1_Init();
    MX_SPI1_Init();
    MX_TIM1_Init();
    MX_TIM2_Init();
    MX_SPI3_Init();
    HAL_Delay(1);
    MX_USART2_UART_Init();
    MX_USART1_UART_Init();
    RetargetInit(&huart1);
    // MX_FATFS_Init();

    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_SET);
    // HAL_UART_RegisterCallback(&huart2, HAL_UART_ERROR_CB_ID, HAL_UART_ErrorCallback);

